/**
 * =============================================================================================
 * Запрос генерации COL USAGE отчета об использования полей указанной таблицы
 * =============================================================================================
 * sys.col_usage$
 * =============================================================================================
 * @param   owner      (VARCHAR2)   Владелец таблицы
 * @param   table_name (VARCHAR2)   Наименование таблицы
 * =============================================================================================
 * Описание полей:
 *  - file#  : имя сгенерированного отчета
 *  - output : содержание отчета
 */
with source as (
    select 'A4M' owner, 'TDOCUMENT' table_name from dual
)
select 
    'COLUSAGE_' || lower(owner) || '_' || lower(table_name) || '.txt' file#,
    dbms_stats.report_col_usage(ownname => owner, 
                                tabname => table_name) output 
from source;





/**
 * =============================================================================================
 * Helpful links
 * =============================================================================================
 * https://oracle-base.com/articles/12c/automatic-column-group-detection-extended-statistics-12cr1
 * =============================================================================================
 */
